Repository: youdidwhat-towho/cmux
Catalog: Prototypes/IrohPhoneMacDemo/iOS/IrohPhoneDemoPackage/Sources/IrohPhoneDemoFeature/Resources/Localizable.xcstrings
Source language: en
Languages: ja

# iroh.demo.defaultMessage
source: Hello from iPhone
ja: iPhone からこんにちは

# iroh.demo.error.invalidResponse
source: The Rust bridge returned invalid JSON.
ja: Rust ブリッジが無効な JSON を返しました。

# iroh.demo.error.missingResponse
source: The Rust bridge returned no response.
ja: Rust ブリッジから応答がありませんでした。

# iroh.demo.error.unknown
source: Unknown iroh error
ja: 不明な iroh エラー

# iroh.demo.idle
source: Waiting for a ticket
ja: チケットを待機中

# iroh.demo.latency.empty
source: No latency sample yet
ja: レイテンシーのサンプルはまだありません

# iroh.demo.latency.header
source: Latency
ja: レイテンシー

# iroh.demo.message.header
source: Request
ja: リクエスト

# iroh.demo.message.placeholder
source: Message
ja: メッセージ

# iroh.demo.missingTicket
source: Paste a Mac ticket first.
ja: 先に Mac のチケットを貼り付けてください。

# iroh.demo.noPasteboardText
source: The pasteboard does not contain text.
ja: ペーストボードにテキストがありません。

# iroh.demo.pasteTicket
source: Paste Ticket
ja: チケットを貼り付け

# iroh.demo.pingMac
source: Ping Mac
ja: Mac に Ping

# iroh.demo.remote
source: Remote: %@
ja: リモート: %@

# iroh.demo.sending
source: Connecting over iroh
ja: iroh で接続中

# iroh.demo.status.header
source: Status
ja: ステータス

# iroh.demo.success
source: Connected in %lld ms
ja: %lld ms で接続

# iroh.demo.terminal.accessibility
source: PTY command
ja: PTY コマンド

# iroh.demo.terminal.emptyOutput
source: No output
ja: 出力なし

# iroh.demo.terminal.exit
source: Exit: %@
ja: 終了コード: %@

# iroh.demo.terminal.exitUnknown
source: unknown
ja: 不明

# iroh.demo.terminal.idle
source: Waiting to run a PTY command
ja: PTY コマンドの実行を待機中

# iroh.demo.terminal.missingCommand
source: Enter a command first.
ja: 先にコマンドを入力してください。

# iroh.demo.terminal.placeholder
source: Command
ja: コマンド

# iroh.demo.terminal.run
source: Run PTY
ja: PTY を実行

# iroh.demo.terminal.sending
source: Running in Mac PTY
ja: Mac PTY で実行中

# iroh.demo.terminal.success
source: PTY returned in %lld ms
ja: %lld ms で PTY が応答

# iroh.demo.ticket.accessibility
source: Iroh ticket
ja: Iroh チケット

# iroh.demo.ticket.footer
source: Copy the ticket from the Mac TUI and paste it here.
ja: Mac TUI からチケットをコピーしてここに貼り付けます。

# iroh.demo.ticket.header
source: Mac Ticket
ja: Mac チケット

# iroh.demo.title
source: Iroh Link
ja: Iroh リンク
